Import Library, Load the Data

In [2]:
import pandas as pd
df_participant = pd.read_csv('https://storage.googleapis.com/.csv')

Transform Bagian I - Kode Pos

In [3]:
df_participant['postal_code'] = df_participant['address'].str.extract(r'(\d+)$')

Transform Bagian II - Kota

In [4]:
df_participant['city'] = df_participant['address'].str.extract(r'(?<=\n)(\w.+)(?=,)')
df_participant['city']

0              Medan
1         Prabumulih
2              Ambon
3       Lubuklinggau
4             Kediri
            ...
4995         Cirebon
4996           Bogor
4997    Tanjungbalai
4998          Manado
4999         Bontang
Name: city, Length: 5000, dtype: object

Transform Bagian III - Github

In [5]:
df_participant['github_profile'] = 'https://github.com/' + df_participant['first_name'].str.lower() + df_participant['last_name'].str.lower()
df_participant['github_profile']

0         https://github.com/citranurdiyanti
1            https://github.com/arissetiawan
2       https://github.com/corneliahandayani
3             https://github.com/solehrajasa
4              https://github.com/viviastuti
                        ...
4995        https://github.com/mitralatupono
4996       https://github.com/indahrahmawati
4997        https://github.com/irsadnajmudin
4998        https://github.com/carlanasyidah
4999       https://github.com/darmanamaryadi
Name: github_profile, Length: 5000, dtype: object

Transform Bagian IV - Nomor Handphone

In [6]:
df_participant['cleaned_phone_number'] = df_participant['phone_number'].str.replace(r'^(\+62|62)', '0')
df_participant['cleaned_phone_number']

0           (0151) 081 2706
1        +62 (036) 461 7027
2              089 833 6695
3        +62 (418) 329-4756
4                0812511835
               ...
4995     +62 (050) 795-8398
4996    +62 (0443) 963 0055
4997    +62 (0408) 216-7689
4998    +62 (0751) 380 3352
4999     +62 (066) 414 8791
Name: cleaned_phone_number, Length: 5000, dtype: object

In [7]:
df_participant['cleaned_phone_number'] = df_participant['cleaned_phone_number'].str.replace(r'[()-]', '')
df_participant['cleaned_phone_number']

0           (0151) 081 2706
1        +62 (036) 461 7027
2              089 833 6695
3        +62 (418) 329-4756
4                0812511835
               ...
4995     +62 (050) 795-8398
4996    +62 (0443) 963 0055
4997    +62 (0408) 216-7689
4998    +62 (0751) 380 3352
4999     +62 (066) 414 8791
Name: cleaned_phone_number, Length: 5000, dtype: object

In [8]:
df_participant['cleaned_phone_number'] = df_participant['cleaned_phone_number'].str.replace(r'\s+', '')
df_participant['cleaned_phone_number']

0           (0151) 081 2706
1        +62 (036) 461 7027
2              089 833 6695
3        +62 (418) 329-4756
4                0812511835
               ...
4995     +62 (050) 795-8398
4996    +62 (0443) 963 0055
4997    +62 (0408) 216-7689
4998    +62 (0751) 380 3352
4999     +62 (066) 414 8791
Name: cleaned_phone_number, Length: 5000, dtype: object

Transform Bagian V - Nama Tim

In [9]:
def func(col):
    abbrev_name = "%s%s"%(col['first_name'][0],col['last_name'][0]) #Singkatan dari Nama Depan dan Nama Belakang dengan mengambil huruf pertama
    country = col['country']
    abbrev_institute = '%s'%(''.join(list(map(lambda word: word[0], col['institute'].split())))) #Singkatan dari value di kolom institute
    return "%s-%s-%s"%(abbrev_name,country,abbrev_institute)

df_participant['team_name'] = df_participant.apply(func, axis=1)
df_participant['team_name']

0          CN-Georgia-UPM
1       AS-Korea Utara-UD
2           CH-Komoro-UHP
3          SR-Eritrea-PTY
4         VA-Aljazair-PHR
              ...
4995     ML-Hongaria-ITSN
4996     IR-Norwegia-CSHT
4997        IN-Ghana-UKWM
4998       CN-Gambia-CP(T
4999     DM-Singapura-PLK
Name: team_name, Length: 5000, dtype: object

Transform Bagian VI - Email

In [10]:

def func(col):
    first_name_lower = col['first_name'].lower()
    last_name_lower = col['last_name'].lower()
    institute = ''.join(list(map(lambda word: word[0], col['institute'].lower().split()))) #Singkatan dari nama perusahaan dalam lowercase

    if 'Universitas' in col['institute']:
        if len(col['country'].split()) > 1: #Kondisi untuk mengecek apakah jumlah kata dari country lebih dari 1
            country = ''.join(list(map(lambda word: word[0], col['country'].lower().split())))
        else:
            country = col['country'][:3].lower()
        return "%s%s@%s.ac.%s"%(first_name_lower,last_name_lower,institute,country)

    return "%s%s@%s.com"%(first_name_lower,last_name_lower,institute)

df_participant['email'] = df_participant.apply(func, axis=1)
df_participant['email']

0         citranurdiyanti@upm.com
1           arissetiawan@ud.ac.ku
2       corneliahandayani@uhp.com
3             solehrajasa@pty.com
4              viviastuti@phr.com
                  ...
4995       mitralatupono@itsn.com
4996      indahrahmawati@csht.com
4997    irsadnajmudin@ukwm.ac.gha
4998       carlanasyidah@cp(t.com
4999       darmanamaryadi@plk.com
Name: email, Length: 5000, dtype: object

Transform Bagian VII - Tanggal Lahir

In [11]:
df_participant['birth_date'] = pd.to_datetime(df_participant['birth_date'], format='%d %b %Y')
df_participant['birth_date']

0      1991-02-05
1      1993-01-11
2      1993-07-31
3      1991-11-04
4      2003-01-22
          ...
4995   2000-04-27
4996   1996-03-06
4997   2003-02-14
4998   1994-08-22
4999   2002-02-09
Name: birth_date, Length: 5000, dtype: datetime64[ns]

Transform Bagian VII - Tanggal Daftar Kompetisi

In [12]:

df_participant['register_at'] = pd.to_datetime(df_participant['register_time'], unit='s')
df_participant['register_at']

0      2021-04-05 14:47:26
1      2021-04-05 14:46:58
2      2021-04-05 14:47:15
3      2021-04-05 14:47:14
4      2021-04-05 14:46:50
               ...
4995   2021-04-05 14:46:16
4996   2021-04-05 14:46:48
4997   2021-04-05 14:46:06
4998   2021-04-05 14:46:45
4999   2021-04-05 14:46:51
Name: register_at, Length: 5000, dtype: datetime64[ns]